zhanglazhuan/NomadCast/debug/t_battery/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# FatFs is pulled into the build via vfs; IDF v5.5's FatFs forces exFAT on,
# which requires long-filename support. Enable LFN (+ label) to avoid
# "LFN must be enabled when enable exFAT" and the related compile errors.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_USE_LABEL=y
